Revit 2027 API
BuiltInFailures.CuttingFailures.NoSupported2DElementsToCopyFromView Property
 None of the elements in the view you have selected are supported for the insert 2D operation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NoSupported2DElementsToCopyFromView { get; }
Public Shared ReadOnly Property NoSupported2DElementsToCopyFromView As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NoSupported2DElementsToCopyFromView {
	FailureDefinitionId^ get ();
}
static member NoSupported2DElementsToCopyFromView : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CuttingFailures Class
Autodesk.Revit.DB Namespace